{"data":{"markdownRemark":{"html":"<p>\n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 960px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 58.099999999999994%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAMABQDASIAAhEBAxEB/8QAGAAAAgMAAAAAAAAAAAAAAAAAAAMBAgT/xAAVAQEBAAAAAAAAAAAAAAAAAAABAP/aAAwDAQACEAMQAAABhmdIIKE//8QAGRAAAwADAAAAAAAAAAAAAAAAAQIDABAT/9oACAEBAAEFAujKXoxhpqErn//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8BP//EABURAQEAAAAAAAAAAAAAAAAAABAR/9oACAECAQE/Aaf/xAAaEAACAgMAAAAAAAAAAAAAAAABEAAhEjJB/9oACAEBAAY/AqhOtvDi/8QAHBAAAwABBQAAAAAAAAAAAAAAAAERMRAhQVFh/9oACAEBAAE/Ic826ZLGBJrkfrJVS1SXp//aAAwDAQACAAMAAAAQPB//xAAVEQEBAAAAAAAAAAAAAAAAAAAQEf/aAAgBAwEBPxCH/8QAFhEBAQEAAAAAAAAAAAAAAAAAARAx/9oACAECAQE/EBZP/8QAGhABAAMAAwAAAAAAAAAAAAAAAQARITFhof/aAAgBAQABPxAQHQ4VkZLVgudv0mm1V52JVraLB6C0Aavcqf/Z'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"The view from our brainstorming location\"\n        title=\"\"\n        src=\"/static/29273c4e38be3feebf674bc40d1ae496/fa9d5/migrating-to-elastic-beanstalk.jpeg\"\n        srcset=\"/static/29273c4e38be3feebf674bc40d1ae496/30a96/migrating-to-elastic-beanstalk.jpeg 240w,\n/static/29273c4e38be3feebf674bc40d1ae496/288d4/migrating-to-elastic-beanstalk.jpeg 480w,\n/static/29273c4e38be3feebf674bc40d1ae496/fa9d5/migrating-to-elastic-beanstalk.jpeg 960w,\n/static/29273c4e38be3feebf674bc40d1ae496/78106/migrating-to-elastic-beanstalk.jpeg 1440w,\n/static/29273c4e38be3feebf674bc40d1ae496/fb391/migrating-to-elastic-beanstalk.jpeg 1920w,\n/static/29273c4e38be3feebf674bc40d1ae496/11ea9/migrating-to-elastic-beanstalk.jpeg 2000w\"\n        sizes=\"(max-width: 960px) 100vw, 960px\"\n      />\n    </span>\n  </span>\n  </p>\n<p>As any app or company grows and scales, your hosting needs change.\nThis is a fact of life that we all deal with.\n1Life, our electronic health record (EHR), is a Rails application that for years had been deployed to a <a href=\"https://12factor.net\">12-factor</a> application platform that we were now outgrowing.\nThis was an opportunity for us to improve our platform, compliance, and security.\nIt was also quite a technical challenge!</p>\n<p>I'm a full-stack engineer on the Technology team at One Medical, who loves operations and is full of opinions on the right way to run a web app.\nAs a member of the Core Infrastructure team, I had the opportunity to work on this project from start to finish.\nI want to walk you through our journey to a new hosting platform.\nIt was challenging, long, and uncertain, and I hope our experience can help you if you're working on a similar migration.</p>\n<h2>Research</h2>\n<p>In theory we could just move our 12-factor compliant code somewhere else, but in reality there are all sorts of particulars not covered by the 12-factor model. Additionally, our code base had been around for close to 10 years at the time of this migration, so there were some potential \"unknown unknowns.\" As we walked into our all-day offsite to explore our options, we needed some criteria to evaluate solutions. We wanted:</p>\n<ul>\n<li>to use the AWS cloud, which <a href=\"aws-hipaa\">is HIPAA-compliant</a> and has a signed BAA with us</li>\n<li>simple environment management - a great developer experience with minimal code or operations required</li>\n<li>vertical and horizontal scaling</li>\n<li>health monitoring and auto-healing</li>\n<li>log aggregation</li>\n<li>rollback</li>\n<li>rolling upgrades</li>\n<li>support for scheduled tasks, one-off tasks, and Rails console sessions</li>\n</ul>\n<p>Then we spent some time considering, investigating, and testing different solutions for hosting 1Life. Our two favorite options were the new EC2 Container Service (ECS), or Elastic Beanstalk. Long story short, we landed on Elastic Beanstalk to host 1Life. Elastic Beanstalk took care of two key operational needs that ECS would require us to do: cluster management and container building.</p>\n<p><img src=\"./migrating-to-elastic-beanstalk-1.gif\" alt=\"a beanstalk growing in time-lapse\"></p>\n<h2>Elastic Beanstalk</h2>\n<p>AWS <a href=\"https://aws.amazon.com/elasticbeanstalk/\">Elastic Beanstalk</a> is a fully-managed application platform.\nThat means we only worry about our application and its interface to Elastic Beanstalk.\nAmazon manages the operating system, compatibility, and security updates, while meeting almost all of our criteria.\nIt's also straightforward to extend with implementations of the criteria it doesn't already support.\nIt supports running instances in a private network inside a VPC.\nFinally, it comes with <a href=\"http://docs.aws.amazon.com/elasticbeanstalk/latest/dg/eb-cli3.html\">a CLI</a> that enables developers to execute common tasks.</p>\n<p>In Elastic Beanstalk, an application has many environments.\nEach environment is a single-purpose collection of servers.\nIf you've used <a href=\"https://devcenter.heroku.com/articles/procfile\">a Procfile</a> before, each line of the Procfile could be considered an environment.\nThe two basic examples are the <code>webserver</code> environment and the <code>worker</code> environment.\nEach instance of our application uses several worker environments to support multiple ActiveJob queues, and a separate scheduled task worker environment.\nEach environment has its own auto-scaling group that keeps enough instances running to meet our needs.</p>\n<p>Using <a href=\"http://docs.aws.amazon.com/elasticbeanstalk/latest/dg/ebextensions.html\"><code>.ebextensions configuration</code></a>, we can meet some of our other requirements.</p>\n<ul>\n<li>We encrypt Elastic Beanstalk AMIs and add nginx configuration to <a href=\"http://docs.aws.amazon.com/elasticbeanstalk/latest/dg/https-singleinstance-ruby.html#Puma\">encrypt data end-to-end</a>, in flight and at rest.</li>\n<li>Logs are uploaded to our log aggregation service by running a collection agent on the application instance.</li>\n</ul>\n<h3>Limitations</h3>\n<p>Elastic Beanstalk makes some assumptions about how your applications work that don't always play nicely with a real Rails application.\nIt only <a href=\"http://docs.aws.amazon.com/elasticbeanstalk/latest/dg/concepts.platforms.html\">supports a limited combination of major language versions and software</a>.\nThat's not a big deal, but it means we need to support the right application server and Ruby version.\nMore restrictive, [worker environments][environments] receive jobs from SQS and execute them via HTTP POST requests from a local daemon.\nThese are things we can work around without requiring significant changes to our application.\nWorker environments can use the <a href=\"https://github.com/tawan/active-elastic-job\">active-elastic-job gem</a> as the ActiveJob backend.</p>\n<p>The CLI is pretty handy, but not complete:</p>\n<ul>\n<li>The VPC support in <code>eb create</code> is great, but it ends there. Connecting to instances inside a VPC requires manual SSH gateway setup.</li>\n<li>The CLI <a href=\"http://docs.aws.amazon.com/elasticbeanstalk/latest/dg/ebcli-compose.html\">supports multiple environments</a>, but only in a rigid fashion that isn't usable when those environments share the same codebase.</li>\n<li>Upgrading running applications to a new version of the platform should be easy with <code>eb upgrade</code>, but using a custom AMI to support on-disk encryption means we can't use that command.</li>\n</ul>\n<p>None of these were dealbreakers. To address these limitations, we wrote our own CLI, <a href=\"https://github.com/onemedical/elastic_beans\">elastic_beans</a>.</p>\n<h3>elastic_beans</h3>\n<p><code>elastic_beans</code> is an opinionated but flexible tool.\nIt is written for Rails applications so it can implement best practices and make assumptions based on that.\nWe used Ruby to implement it so that its users, Rails developers, can more easily contribute.</p>\n<p>During setup it will configure your application to meet the best-practice criteria for a HIPAA-compliant Rails application.\nThere's a lot to configure, so one of the opinions <code>elastic_beans</code> has is that you should use <a href=\"https://aws.amazon.com/cloudformation/\">CloudFormation</a> to set up your infrastructure.\nCloudFormation can expose the details <code>elastic_beans</code> needs through Outputs so it can look up information automatically.</p>\n<p>Using this CLI, we can automate tasks that are painful with the <code>eb</code> CLI.\n<code>elastic_beans</code> provides a standard configuration that is stored in configuration templates so environments can be started, terminated, and restarted at will.\nIt creates and scales those environments on demand.\nDeploys of code and updates to configuration or environment variables are applied to all environments simultaneously.\nTasks like running rake tasks, SSH access, and opening a Rails console are handled without putting more load on webservers or workers.</p>\n<p>We can also fill in gaps and surprises in Elastic Beanstalk functionality.\nElastic Beanstalk <a href=\"https://forums.aws.amazon.com/thread.jspa?messageID=618423&#x26;#618423\">imposes a 4096-byte limit on environment variables</a> because of its dependency on CloudFormation.\n<code>elastic_beans</code> manages environment variables in S3 to avoid this.\nPeriodic tasks are handled by Elastic Beanstalk, but every application would need to reimplement handling Elastic Beanstalk's method of executing them.\n<code>elastic_beans</code> can intercept these requests, enqueue them, and process them out of band, avoiding forcing tasks into the web request lifecycle and a maximum 30-minute timeout.</p>\n<h2>Migration</h2>\n<p>Overall the migration process has been fairly straightforward.\n<code>elastic_beans</code> has helped the Core Infrastructure group spare the rest of the team from most of these difficulties.\nWe are excited to be using a more secure, compliant, and scalable hosting platform!</p>\n<p>In future articles in this series, I will cover some of the issues we have overcome and how <code>elastic_beans</code> helps us solve them.</p>\n<ol>\n<li>Migrating to Elastic Beanstalk</li>\n<li><a href=\"./elastic-beanstalk-end-to-end-encryption-and-private-networking.html\">End-to-End Encryption and Private Networking</a></li>\n<li><a href=\"./elastic-beanstalk-migrating-background-jobs-to-sqs.html\">Migrating Background Jobs to SQS</a></li>\n<li><a href=\"./elastic-beanstalk-one-off-and-periodic-tasks.html\">Periodic Tasks</a></li>\n</ol>","fields":{"post":{"title":"Migrating to Elastic Beanstalk","link":null,"timestamp":"2017-02-07T18:20Z","date":"February 7, 2017 6:20pm UTC"}}}},"pageContext":{"slug":"/migrating-to-elastic-beanstalk"}}